OpenFOAM-v2106/tutorials/multiphase/icoReactingMultiPhaseInterFoam/mixerVesselAMI2D/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Get both sides of ami
    // ~~~~~~~~~~~~~~~~~~~~~

    // Get all faces in cellSet
    {
        name    AMI;
        type    faceSet;
        action  new;
        source  patchToFace;
        patch   "AMI.*";
    }
);


// ************************************************************************* //
